ЕРПУХАстенд.cbr_Основной/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6b652820-7672-43f5-a265-2bed82a309a6">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6cc3a6d7-54b4-4e21-af19-24297ed6494a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="83b54fd4-b18d-4dfc-aa84-3391845a4e5b">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a24a1454-023d-4c52-b65c-48eac9aa6b26">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="38ea66f4-5bfa-48f1-8431-a99d27fcf31d">
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4429caf-ac6e-49ad-bef0-355badcab738">
    <name>КоличествоУпаковокПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e4bc4c5c-4c75-4666-8d21-f7f403a23514">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cef36287-09dd-4448-9e9e-5c90a8111d2c">
    <name>НаименованиеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Очередь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>15</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e9606203-88e5-4b62-bc25-9f152c0eecfe">
    <name>ПартияПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e76279a-4f34-44a9-b997-752bfa2a4a30">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d12a6578-0ee7-4c40-a0c0-f24b03afa6bc">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0662487e-07e7-4fe3-b008-ffb293a9f154">
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49fb8c7a-a984-433d-9013-98b3f1808eba">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e72bf9d-e251-478c-bd3e-7fb8e78584c0">
    <name>ТребуетсяЗаполнитьПоОперациям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88bb5796-07b6-4854-bafc-05701368c7dc">
    <name>ФактическоеНачалоЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97258e31-badf-4c52-808f-88d24f4369d1">
    <name>ФактическоеОкончаниеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d65a15ce-a56d-4017-bbbc-210858c2c05f">
    <name>Этап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="273df2c3-514f-4b41-af58-a60420b68979">
    <name>КоличествоУпаковокФакт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>П3_СлужебныйПересчетВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтатусДоКонтроля</name>
    <type>
      <types>EnumRef.СтатусыЭтаповПроизводства2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДатаДокументКотнроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ВремяКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТехПотери</name>
    <comment>//++ ШмелевР 04.03.2026 ПРЗ.3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_Брак</name>
    <comment>//++ ШмелевР 04.03.2026 ПРЗ.3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Действия</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f0cdedc1-9f3a-4821-ab6c-f2792fa18854">
    <name>ВыходныеИзделияСерии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="028a2250-ffdf-406c-868f-fb624d295146">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="96e6c801-bf9a-48f0-9e19-1f68a05fe6eb">
    <name>ОбеспечениеМатериаламиИРаботами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2849e137-bfbf-4c16-b65f-8183ef3dcfd6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e615f87c-b1fe-424a-ba73-2107af37992d">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc5c02ab-4758-47ca-a469-aeac95072209">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="dc035f49-1f37-4bf6-a369-751f132442a2">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="20aa6e93-6a18-4526-830f-8d45d3e04bb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>П3_НазначениеДоПересчета</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ДвижениеПродукцииИМатериалов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьПередачуМатериаловНаОснованииРасходногоОрдера(РасходныйОрдер) Экспорт

	РезультатФункции = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус КАК Статус,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение ССЫЛКА Документ.ЭтапПроизводства2_2 КАК РаспоряжениеЭтоЭтап,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад КАК Склад
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = &РасходныйОрдер
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение ССЫЛКА Документ.ЭтапПроизводства2_2,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад";
	
	Запрос.УстановитьПараметр("РасходныйОрдер", РасходныйОрдер);
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЭтапов = РезультатЗапроса.Выбрать();
	
	Если ВыборкаЭтапов.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru='Вы расходном ордере ""%1"" указано больше одного этапа производства'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РасходныйОрдер);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Если Не ВыборкаЭтапов.Следующий() Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Если Не ВыборкаЭтапов.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Отгружен") Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ЭтапПроизводства = ВыборкаЭтапов.Распоряжение;
	Распоряжения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭтапПроизводства);
	ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство");
	ДанныеДляПроверки = Документы.ДвижениеПродукцииИМатериалов.ДанныеДляПроверкиВводаНаОсновании(Распоряжения, ХозяйственнаяОперация);
	ДанныеДляПроверки.Отправитель = ВыборкаЭтапов.Склад;
	
	Если Не ЗначениеЗаполнено(ДанныеДляПроверки.РаспоряженияКОформлению) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.ДвижениеПродукцииИМатериалов.ПараметрыЗаполненияДокумента();
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДанныеДляПроверки);
	РеквизитыШапки = Документы.ДвижениеПродукцииИМатериалов.ДанныеЗаполненияНакладной(ДанныеДляПроверки.РаспоряженияКОформлению, 
																					  ДанныеДляПроверки);
	Документы.ДвижениеПродукцииИМатериалов.ИнициализироватьПараметрыЗаполнения(ПараметрыЗаполнения, 
																			   РеквизитыШапки,
																			   ДанныеДляПроверки.РаспоряженияКОформлению);
																			   
	ДокументПередачаМатериалов = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	ДокументПередачаМатериалов.Дата = ТекущаяДатаСеанса();
	ДокументПередачаМатериалов.Заполнить(ПараметрыЗаполнения);
	
	ДокументПередачаМатериалов.Записать(РежимЗаписиДокумента.Запись);
	РезультатФункции = ДокументПередачаМатериалов.Ссылка;
	
	ОшибкаПроведения = Ложь;
	
	Если ДокументПередачаМатериалов.Товары.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В документе %1 не заполнена номенклатура!'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатФункции);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ОшибкаПроведения = Истина;
	КонецЕсли;
	
	Если Не ОшибкаПроведения Тогда
		
		Попытка
			
			ДокументПередачаМатериалов.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
			Инфо = ИнформацияОбОшибке();
			ОшибкаПроведения = Истина;		
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если ОшибкаПроведения Тогда
		ТекстСообщения = НСтр("ru='Не удалось провести документ %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатФункции);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции // СоздатьПередачуМатериаловНаОснованииРасходногоОрдера()

Функция СоздатьПередачуМатериаловНаОснованииЭтапа(ЭтапПроизводства) Экспорт

	РезультатФункции = Неопределено;
	
	Распоряжения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭтапПроизводства);
	ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство");
	ДанныеДляПроверки = Документы.ДвижениеПродукцииИМатериалов.ДанныеДляПроверкиВводаНаОсновании(Распоряжения, ХозяйственнаяОперация);
	
	Если Не ЗначениеЗаполнено(ДанныеДляПроверки.РаспоряженияКОформлению) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.ДвижениеПродукцииИМатериалов.ПараметрыЗаполненияДокумента();
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДанныеДляПроверки);
	РеквизитыШапки = Документы.ДвижениеПродукцииИМатериалов.ДанныеЗаполненияНакладной(ДанныеДляПроверки.РаспоряженияКОформлению, 
																					  ДанныеДляПроверки);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, РеквизитыШапки, "Отправитель");
	Документы.ДвижениеПродукцииИМатериалов.ИнициализироватьПараметрыЗаполнения(ПараметрыЗаполнения, 
																			   РеквизитыШапки,
																			   ДанныеДляПроверки.РаспоряженияКОформлению);

	ДокументПередачаМатериалов = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	ДокументПередачаМатериалов.Дата = ТекущаяДатаСеанса();
	ДокументПередачаМатериалов.Заполнить(ПараметрыЗаполнения);

	Если ДокументПередачаМатериалов.Товары.Количество() = 0 Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ДокументПередачаМатериалов.Записать(РежимЗаписиДокумента.Запись);
	РезультатФункции = ДокументПередачаМатериалов.Ссылка;
		
	ОшибкаПроведения = Ложь;
	Попытка
		
		ДокументПередачаМатериалов.Записать(РежимЗаписиДокумента.Проведение);
	
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		ОшибкаПроведения = Истина;		
		
	КонецПопытки;
	
	Если ОшибкаПроведения Тогда
		ТекстСообщения = НСтр("ru='Не удалось создать документ Передача материалов в производство. Чтобы провести Этап производства создайте Передачу материалов вручную и после этого проведите документ'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции // СоздатьПередачуМатериаловНаОснованииЭтапа()

Функция СоздатьПередачуМатериаловНаОснованииЭтапаСЗаполнениеТоваров(ЭтапПроизводства, Товары) Экспорт

	РезультатФункции = Неопределено;
	
	Распоряжения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭтапПроизводства);
	ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство");
	ДанныеДляПроверки = Документы.ДвижениеПродукцииИМатериалов.ДанныеДляПроверкиВводаНаОсновании(Распоряжения, ХозяйственнаяОперация);
	
	Если Не ЗначениеЗаполнено(ДанныеДляПроверки.РаспоряженияКОформлению) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.ДвижениеПродукцииИМатериалов.ПараметрыЗаполненияДокумента();
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДанныеДляПроверки);
	РеквизитыШапки = Документы.ДвижениеПродукцииИМатериалов.ДанныеЗаполненияНакладной(ДанныеДляПроверки.РаспоряженияКОформлению, 
																					  ДанныеДляПроверки);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, РеквизитыШапки, "Отправитель");
	Документы.ДвижениеПродукцииИМатериалов.ИнициализироватьПараметрыЗаполнения(ПараметрыЗаполнения, 
																			   РеквизитыШапки,
																			   ДанныеДляПроверки.РаспоряженияКОформлению);

	ДокументПередачаМатериалов = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	ДокументПередачаМатериалов.Дата = ТекущаяДатаСеанса();
	ДокументПередачаМатериалов.Заполнить(ПараметрыЗаполнения);

	ДокументПередачаМатериалов.Товары.Очистить(); 
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		НоваяСтрока = ДокументПередачаМатериалов.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
	КонецЦикла;
	
	ПараметрыУказанияСерий = Документы.ДвижениеПродукцииИМатериалов.ПараметрыУказанияСерий(ДокументПередачаМатериалов);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументПередачаМатериалов, ПараметрыУказанияСерий);
	
	ДокументПередачаМатериалов.Записать(РежимЗаписиДокумента.Запись);
	РезультатФункции = ДокументПередачаМатериалов.Ссылка;
		
	ОшибкаПроведения = Ложь;
	Попытка
		
		ДокументПередачаМатериалов.Записать(РежимЗаписиДокумента.Проведение);
	
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		ОшибкаПроведения = Истина;		
		
	КонецПопытки;
	
	Если ОшибкаПроведения Тогда
		ТекстСообщения = НСтр("ru='Не удалось создать документ Передача материалов в производство для Замывки.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции // СоздатьПередачуМатериаловНаОснованииЭтапаСЗаполнениеТоваров()

#КонецОбласти

#КонецЕсли
